cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1236H6PM.svd
        <register>
          <name>SCGCWTIMER</name>
          <description>Wide Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000075C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCWTIMER_S0</name>
              <description>Wide Timer 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWTIMER_S1</name>
              <description>Wide Timer 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWTIMER_S2</name>
              <description>Wide Timer 2 Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWTIMER_S3</name>
              <description>Wide Timer 3 Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWTIMER_S4</name>
              <description>Wide Timer 4 Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWTIMER_S5</name>
              <description>Wide Timer 5 Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCWD</name>
          <description>Watchdog Timer Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000800</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCWD_D0</name>
              <description>Watchdog Timer 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWD_D1</name>
              <description>Watchdog Timer 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCTIMER</name>
          <description>Timer Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000804</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCTIMER_D0</name>
              <description>Timer 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCTIMER_D1</name>
              <description>Timer 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCTIMER_D2</name>
              <description>Timer 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCTIMER_D3</name>
              <description>Timer 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCTIMER_D4</name>
              <description>Timer 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCTIMER_D5</name>
              <description>Timer 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCGPIO</name>
          <description>General-Purpose Input/Output Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000808</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCGPIO_D0</name>
              <description>GPIO Port A Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D1</name>
              <description>GPIO Port B Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D2</name>
              <description>GPIO Port C Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D3</name>
              <description>GPIO Port D Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D4</name>
              <description>GPIO Port E Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D5</name>
              <description>GPIO Port F Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D6</name>
              <description>GPIO Port G Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCDMA</name>
          <description>Micro Direct Memory Access Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000080C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCDMA_D0</name>
              <description>uDMA Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000818</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCUART_D0</name>
              <description>UART Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D1</name>
              <description>UART Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D2</name>
              <description>UART Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D3</name>
              <description>UART Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D4</name>
              <description>UART Module 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D5</name>
              <description>UART Module 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D6</name>
              <description>UART Module 6 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D7</name>
              <description>UART Module 7 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCSSI</name>
          <description>Synchronous Serial Interface Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000081C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCSSI_D0</name>
              <description>SSI Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D1</name>
              <description>SSI Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D2</name>
              <description>SSI Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D3</name>
              <description>SSI Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCI2C</name>
          <description>Inter-Integrated Circuit Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000820</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCI2C_D0</name>
              <description>I2C Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D1</name>
              <description>I2C Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D2</name>
              <description>I2C Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D3</name>
              <description>I2C Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D4</name>
              <description>I2C Module 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D5</name>
              <description>I2C Module 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCUSB</name>
          <description>Universal Serial Bus Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000828</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCUSB_D0</name>
              <description>USB Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCCAN</name>
          <description>Controller Area Network Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000834</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCCAN_D0</name>
              <description>CAN Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCADC</name>
          <description>Analog-to-Digital Converter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000838</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCADC_D0</name>
              <description>ADC Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCADC_D1</name>
              <description>ADC Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCACMP</name>
          <description>Analog Comparator Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000083C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCACMP_D0</name>
              <description>Analog Comparator Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCEEPROM</name>
          <description>EEPROM Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000858</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCEEPROM_D0</name>
              <description>EEPROM Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCWTIMER</name>
          <description>Wide Timer Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000085C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCWTIMER_D0</name>
              <description>Wide Timer 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D1</name>
              <description>Wide Timer 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D2</name>
              <description>Wide Timer 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D3</name>
              <description>Wide Timer 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D4</name>
              <description>Wide Timer 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D5</name>
              <description>Wide Timer 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRWD</name>
          <description>Watchdog Timer Peripheral Ready</description>
          <addressOffset>0x00000A00</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRWD_R0</name>
              <description>Watchdog Timer 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRWD_R1</name>
              <description>Watchdog Timer 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRTIMER</name>
          <description>Timer Peripheral Ready</description>
          <addressOffset>0x00000A04</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRTIMER_R0</name>
              <description>Timer 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R1</name>
              <description>Timer 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R2</name>
              <description>Timer 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R3</name>
              <description>Timer 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R4</name>
              <description>Timer 4 Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R5</name>
              <description>Timer 5 Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRGPIO</name>
          <description>General-Purpose Input/Output Peripheral Ready</description>
          <addressOffset>0x00000A08</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRGPIO_R0</name>
              <description>GPIO Port A Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R1</name>
              <description>GPIO Port B Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R2</name>
              <description>GPIO Port C Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R3</name>
              <description>GPIO Port D Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R4</name>
              <description>GPIO Port E Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R5</name>
              <description>GPIO Port F Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R6</name>
              <description>GPIO Port G Peripheral Ready</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRDMA</name>
          <description>Micro Direct Memory Access Peripheral Ready</description>
          <addressOffset>0x00000A0C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRDMA_R0</name>
              <description>uDMA Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Peripheral Ready</description>
          <addressOffset>0x00000A18</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRUART_R0</name>
              <description>UART Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R1</name>
              <description>UART Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R2</name>
              <description>UART Module 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R3</name>
              <description>UART Module 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R4</name>
              <description>UART Module 4 Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R5</name>
              <description>UART Module 5 Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R6</name>
              <description>UART Module 6 Peripheral Ready</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R7</name>
              <description>UART Module 7 Peripheral Ready</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSSI</name>
          <description>Synchronous Serial Interface Peripheral Ready</description>
          <addressOffset>0x00000A1C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRSSI_R0</name>
              <description>SSI Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R1</name>
              <description>SSI Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R2</name>
              <description>SSI Module 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R3</name>
              <description>SSI Module 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI2C</name>
          <description>Inter-Integrated Circuit Peripheral Ready</description>
          <addressOffset>0x00000A20</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRI2C_R0</name>
              <description>I2C Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R1</name>
              <description>I2C Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R2</name>
              <description>I2C Module 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R3</name>
              <description>I2C Module 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R4</name>
              <description>I2C Module 4 Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R5</name>
              <description>I2C Module 5 Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRUSB</name>
          <description>Universal Serial Bus Peripheral Ready</description>
          <addressOffset>0x00000A28</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRUSB_R0</name>
              <description>USB Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
